review/APE/Marshall_et_al_2007.org
#+TITLE: Marshall et al (2007) 読書ノート
#+AUTHOR: KAWAI Yuta
#+LANGUAGE: ja
#+HTML_MATHJAX: align:"left" mathml:t path:"http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML"></SCRIPT>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./../org.css" />


#+begin_abstract 
- 現代の軌道と CO_2 の強制によって駆動される, 陸なしの大気・海洋・氷結合システムの気候の数値実験を行った. 
- 約千年間の時間スケールのシミュレーションは, 次の平均状態を与えた. 
  - 氷冠は, 緯度 55° まで達した. 
  - 大気と海洋はともに東西方向の帯状ジェットから成る. ジェットの構造は傾圧不安定によって調整される. 
  - 海洋の帯状的特徴にもかかわらず, エクマン輸送と渦によって駆動される沈み込みの働きを介した南北方向の熱輸送は
    とても効率的である. 
    - 大気・海洋間の熱輸送の分配は, 現代気候とかなり同じである(熱帯では海洋, 中高緯度では大気の熱輸送が卓越する). 
  - 系の変動性は, 大気と海洋の環状モードのカップリングによって支配される. 
    - 大気のジェットに由来する確率的な変動性は, 海洋の変動を駆動する. 
    - 海洋の帯状流は十年周期の変動性を見せる. この変動性は大気にフィードバックして, 
      環状モードの変動性のスペクトルを特色づける. 
    - 簡単な確率モデルによって, この過程を捉えることができる. 
  - 最後に, 水惑星が, 地球の熱輸送の分配と気候を決める過程の情報をどのように与えることをできるかを, 
    再吟味する. 
#+end_abstract

* イントロダクション
** 研究の概要
- 惑星の気候の決定における大気と海洋の相互作用の特性を理解するために, 大気・海洋・氷の結合システムの数値モデルを用いて,
  極めて理想化された GFD 的実験を行った. 
  - 目標は地球の現在気候や古気候を計算することではなく, 結合システムの詳細を調べることである. 
  - 地形や海陸分布の複雑性は簡単化して考える(実際陸を完全に取り除く:水惑星設定)が, 
    必要とされる流体の力学は十分に表現される. 
- この実験では, 陸がないことを除けば, 全ての他の特徴は現在の地球であるような惑星の極限を調べる. 
  - 惑星は 5.2 km の一様な水深をもつ海洋に全体が覆われている. 
  - 海洋の上には大気が存在し, 入射する太陽放射によってエネルギーを与えられる. 
  - 条件を満たせば, 氷が形成される. 

** 「水惑星(aquaplanet)」設定を使った先行研究
- 大気モデリングをする研究者の間では, 「水惑星」とは,  
  スラブオーシャンまたは指定された海水面温度(SST)分布を結合した大気のことを示唆することに注意すること. 

*** Hess(1993)
- 指定された SST を使う水惑星設定を用いて, さまざまな緯度依存の SST 分布に対する熱帯収束帯(ITCZ) の感度を調べた. 

*** Kirtman and Schneider(2000), Barsugli et al.(2005)
- 大気を熱力学的な海洋モデルと結合して, 熱帯の降水が熱帯の平均状態に鋭敏であることを示した. 

*** 先行研究に対する Marshall et al(2007) の研究の位置づけ
- 力学を表現し全球中に特性を輸送できる, 大気モデルと海洋モデルをフルカップリングする. 
- このような計算はこれなであまりなされていない. 少数の例は Smith et al.(2006) (S06). 
  - S06 は, 結合システムにおける海洋循環の役割, 
    特に全球に熱を輸送するための海洋の能力に対する地理的な制約の重要性を強調する. 
- 本論文の純粋な水惑星設定は, S06 の参照実験の設定と同じものであるが, 
  海洋モデルの定式化に重要な違いが存在する. 
  - その違いによって, S06 の気候状態と大変異なった気候状態が得られた. 

** 水惑星設定で得られる気候状態の簡単な特徴(第二節の概略)
- 大気
  - 水惑星の大気は, 現代地球の大気とまずまず似ている. 
    - 加熱/冷却の差異によって, 大気の風系は駆動される. 
      - 熱帯のハドレーレジーム, 傾圧不安定によって壊れる中緯度のジェット
    - (M07 では) 極域の冷却は氷冠の形成をもたらす. 
    - 大気の総観規模のシステムによる運動量輸送が, 中高緯度域の西風, 低緯度域の東風を維持する. 
      - これらの風は海洋の真上で吹き, 海洋の運動を励起する. 
 
- 海洋 
  - 海洋において境界がないことは, 現在地球とかなり異なる海洋の循環パターンを与える. 
    - 循環パターンは帯状ジェットであり, その方向は大気の優勢な風向きによって決まる. 
      - 熱帯ベルトでは東寄り, 中緯度では西寄りのジェット
      - この帯状ジェットの力学は現代の南極周回流(Antarctic Circumpolar Current: ACC)の力学を連想させる. 
    - 海洋の子午面循環は全体的に, 風と渦によって駆動される沈み込みと関係する. 
      - 極域で対流的に駆動される「熱塩循環」は存在しない. 
      - 子午面循環は, 赤道から中緯度まで伸びる, 残差平均により現れる海洋の「亜熱帯」セルを含む. 

- 大気・海洋間の南北熱輸送の分配 
  - M09 の計算では, 水惑星での大気と海洋の熱輸送の分配は, 現在気候とよく似ていることが分かった. 

** 結合システムで見られる変動性について(第三節の概略)
 - 南北方向の境界が存在しないために永続的な東西方向の温度勾配は存在せず, "ENSO"現象は現れない. 
 - 変動性の卓越するオーダーは中緯度の「環状モード」であり, その環状モードにおいて, 大気の西風は強さと位置の両方がゆらぐ. 
   - この変動は, 海洋の帯状ジェットを駆動する東西風の応力に変化を起こす. 
 - 結合システムの変動性の究極的な起源は, 大気の帯状ジェットに伴う総観システムの相互作用による「かきまぜ」である. 
 - しかし, 二流体の環状モードのカップリングは, 両方の流体で明瞭な十年周期のシグナルをみせることが分かった. 
   - 発見した変動性の簡単な確率モデルを開発し, 結合メカニズムの本質をとらえた. 
     

* 結合モデルの記述
** MITgcm(Marshall et al., 1997)
- 一つの静力学コアから大気モデルと海洋モデルを得るために, 流体の同型性を採用する. 
- 水平格子: 大気・海洋とも立方球面格子
  - 解像度 C32(格子幅約 280 km)
  - 緯度経度格子のように極域で格子が集中しない. 

** 大気モデル 
- 中程度の複雑さ(Atmosphere InterMediate complexity: AIM)
  - 鉛直解像度: 5 層(75, 250, 500, 750, 950 hPa)
  - 物理過程: SPEEDY(Molteni, 2003)
    - 4 バンド放射スキーム, 湿潤対流パラメタリゼーション, 境界層スキーム他

** 海洋モデル
- 鉛直解像度: 15 層
  - 海底は平坦で, 海洋の深さは 5.2 km
  - 層の幅は表層で 50 m, そして深くなるほど大きくなり, 深部では 690 m. 
- diapycnal 混合
  - 混合係数: 3\times10^{-5} m^2 s^{-1} 
- 海底の摩擦
  - 海底が平坦なため, 風により注入された運動量とバランスする役割を果たす, 地形の摩擦が存在しない. 
    - 一方, ACC では海底地形の摩擦が主な運動量のシンク. 
  - 強い順圧的な帯状流の生成を避けるために, 深層流がゼロとなるように海底の(線形)摩擦パラメータを調整する. 
- (地衡流)渦のパラメタリゼーション
  - Gent and Williams(1990)
  - 輸送係数: 800 m^2 s^{-1}
- 対流のパラメタリゼーション
  - 対流調節: 温度・塩分の強い鉛直混合として実装

** 氷モデル
- 熱力学的氷モデル(Winton, 2000)

** 強制について
- 軌道と関係した強制, CO2 レベルは, 現在気候の値を使う. 
  - 季節サイクルは表現されるが, 日変化は存在しない. 

** その他
- システム全体は, 並列計算機上で時間積分される. 
  - 大気モデルは各面ごとに 1 CPU, 海洋モデルとカップリング処理にそれぞれ 1 CPU づつ割り振る. 
  - 結合モデルを 1000 年間積分するのに二週間かかる. 
- 大気・海洋モデル間の, 運動量, 熱, 淡水フラックスの交換は, 毎時間(海洋モデルの時間ステップ)で行う. 
- 海洋モデルの初期条件: 静止状態. 温度と塩分は気候値の東西平均. 
- 4000 年積分するとおおよそ準平衡状態に落ち着く. 
  - 以後示す平均状態とは, 最後の 100 年間の場を平均したものである. 


* 結果
** 平均状態
*** 温度, 水蒸気, 風, 海流の分布
- 温度
  - 熱帯域で弱い水平温度勾配, そしてその終端から極まで広い傾圧帯が両半球で見られる.
  - 極は寒冷(約250K)で 55 度付近まで氷に覆われている. 
  - 海氷の下では, 数百メートルの温度の逆転層が見られる. 
    - 塩分はそれを補償するように小さい. 
  - 水惑星の主躍層は地球と似ている. 
    - 暖水域の深さは亜熱帯で約 1 km, 赤道の湧昇域では著しく薄い. 
  - 温度躍層や極域の下では, 深層の約 2 ℃ の温度で良く混ぜられている. 
    - 良く混合した深層の流体は, 高緯度域の上昇流によって海面まで持ち上げられる. 

- 風
  - 境界層や熱帯から遠い場所では, 風や海流は南北温度勾配と関連した温度風バランスにある. 
  - 亜熱帯の西風ジェット(250 hPa で 30 ms^{-1} に達する), 赤道域では東風. 
    - 緯度 30 度より極側では海面の西風が東向きの応力を, 赤道の両側では貿易風が西向きの応力を引き起こす. 
    - 極偏東風は存在しない. 

- 海流
  - 海岸が存在しないため, 海洋では, 海面応力と同方向の帯状ジェットが見られる. 
    - 内部領域では, 帯状ジェットは傾いた密度面と関係した温度風バランスにある. 
  - 海面応力は eddy drag により弱められながら流体コラムの下まで達し, 海底の応力と完全にバランスする. 
  - 海面において, 赤道に沿う西向きの流れは 0.8 ms^{-1}, 中緯度の東向きの流れは 0.2 ms^{-1} に達する. 

- 海洋の鉛直流
  - 海面応力の回転により駆動されるエクマン・パンピングの場は, 温度躍層の下部表面のうねりを説明する. 
  - 赤道帯(応力の回転がゼロとなる緯度 20 度まで)では, 深部の冷水が上昇している.  
  - 緯度 20 度から 45 度の間では, 暖水が地表から下降している. 
   
- 水蒸気, 塩分
  - 比湿は空気の暖かいところで大きい(赤道下層で, 15 g kg^{-1}, 高度や緯度が高くなるにつれ減少). 
  - 水蒸気の「mirror imgae」である海洋の塩分場は, 舌状の分布をみせる. 
    - 亜熱帯では蒸発が降水を上回る. 熱帯・高緯度では, 降水が蒸発を上回る. 
  - 氷の下の塩分の低さは, 温度の逆転を安定化させている. 
    
  
*** 子午面循環
- オイラー平均子午面循環 
 - 大気: 赤道の両側で対称なハドレーセル, 中・高緯度でフェレルセル. 
 - 海洋: 大気の子午面循環と同じパターン 
 - 大気・海洋の境界層内で大規模渦による水平渦運動量フラックスが無視できる限り, 両方の流線関数は同じになるだろう. 
   - 熱帯域のハドレーセルでは当てはまる. 
   - 中緯度では大気の流線関数が 50 % ほど海洋を上回る(しかしオーダ的には同じ). 
      - 総観規模の渦と関係した渦運動量フラックスが無視できないため
 - しかし, 大気の渦が駆動する質量フラックスは, 海洋の典型的な子午面循環の強度よりずっと強い
   - 大気・海洋間の熱輸送の分配に関する重要な事実

- 海洋の残差循環
  - (残差循環) = (オイラー平均) + (渦で駆動される循環)
    - 渦で駆動される循環は,  オイラー平均と逆センスの傾向がある. 
    - 中・高緯度では, 完全にキャンセルする. 
  - なぜ逆センスなのか? (Gill et al, 1974)
    - 海面応力のパターンは, 亜熱帯で海面の浮力分布を押し下げ, 熱帯と高緯度で深層の浮力を吸い上げる. 
    - 等密度面の傾きは, 傾圧不安定のための有効位置エネルギーを貯蓄する. 
    - 傾圧不安定は平均的な浮力面を平坦にする <- これは海面の風の効果と相反する. 
  - 極域の海洋の成層は弱いが, 極の沈み込みによって駆動される熱塩循環は見られない.
    
* 解析: 力学的な解釈
- Marshall and Radiko(2003) (MR03) : ACC のような海洋の帯状流に対する簡単なモデルを開発. 
  - MR03 のモデルを適切に修正することによって, 水惑星の海洋の平均的な状態(平均子午面循環)を説明する. 

** 定式化
- 帯状平均, 残差平均された運動量方程式

   \begin{equation}
    - f v_{res} = \frac{1}{\rho} \left[ 
      \left( \frac{\partial \tau}{\partial z} + \frac{\partial \tau_e}{\partial z} \right)
      + A_h \nabla^2 u_{res}
      \right]
   \end{equation}

  - where $\tau$ は(海面/海底の)応力. 渦応力は, 

    \begin{equation}
      \tau_e = \rho f \frac{\overline{v'b'}}{\partial \bar{b}/\partial z}
        = \rho f K s_\rho = \rho f \psi^*
    \end{equation}

    とパラメータ化する. 
    $\Psi^*$ は bolus streamfuncion, $K(=-\overline{v'b'}/(\partial \bar{b}/\partial y))$ は渦輸送係数, 
    $s_\rho(= - (\partial \bar{b}/\partial y)/(\partial \bar{b}/\partial z))$ は平均的な浮力面の傾き. 

  - これは, Gent and McWilliams(1990) のパラメタリゼーションの残差平均の解釈である. 
  - 運動量の水平混合を表す項を含めている. 
    - 西岸境界流と関係した摩擦境界層(Munk, 1950)を表すモデルで必要とされる

- 帯状平均, 残差平均された浮力方程式

  \begin{equation}
    J(\Psi_{res}, \bar{b}) = \frac{\partial \mathscr{B}}{\partial z}
  \end{equation}

  - where $\mathscr{B}$ は, 小スケールの過程や大気-海洋のフラックスによる浮力フラックス. 
  - 内部領域では浮力フラックスの寄与は小さく, 近似的に $J(\Psi_{res}, \bar{b})=0$ である. 
    - 実際, Fig.4(bottm) のように, $\Psi_{res}$ と $\bar{b}$ の等値線は重なる. 
  - 温度躍層の構造を求めるには, $\Psi_{res}$ と $\bar{b}$ の関数関係が表層の過程により決められる必要がある. 
    - Marshall(1997) では $\Psi_{res} = - \mathscr{B}_s/\bar{b}_y$ と決まったが,
      今の場合, そのような簡単な関係は見つけられないので, モデル結果から与える.

** 残差循環の流線関数

- 帯状平均, 残差平均された運動量方程式を海面から $z$ まで積分すれば, 

  \begin{equation}
    \Psi_{res} (y,z) = - \frac{1}{\rho} \frac{\tilde{\tau}}{f} + K s_\rho = \overline{\Psi} + \Psi^*
    \label{BolusStreamFunc}
  \end{equation}

  - where

  \[
      \tilde{\tau} = \tau_s + \int^0_{-z} A_H \nabla^2 u \; dz
  \]

  - 水平方向の運動量混合が無視できるならば, $\bar{\Psi}$ は深さに依存しない. 
    - このとき, 海面と海底のエクマン層の輸送は真反対になる.  
  - しかし, 実際 $\bar{\Psi}$ は内部領域で深さに依存している. 
    - 運動量バランスの中で粘性の役割は, 無視できない. 


** 温度躍層の構造の決定

- アルゴリズム

  \(\eqref{BolusStreamFunc}\) を整理して, 

  \begin{equation}
    s_\rho = \dfrac{1}{K} \left[ \Psi_{res}(\bar{b}) + \dfrac{1}{\rho}\dfrac{\tilde{\tau}}{f}   \right]
    \label{relattion_bSlope_resSF_eulerM}
  \end{equation}

  - 表層の $\bar{b}$ 分布とモデルから得られる関数間係 $\Psi(\bar{b})$ を与えれば, 特性法(see MR03)を使って上の式を積分することにより, 
    $\bar{b}$ の解を得る(Fig. 5).  
      
- 得られた解とモデルの計算結果の比較(Fig.5)
  - 両者は良く一致している. 
  - MR03 の ACC とその子午面循環の理論の心である力学バランス \(\eqref{relattion_bSlope_resSF_eulerM}\) が, 水惑星の海洋に適切であることを示唆する. 
    - スベルドラップバランスとは, 根本的に違う点に注意
  - 温度躍層の深さは渦のプロセスによって根本的に制限される. 

*  解析: 結合システムの熱輸送


* 解析: 結合システムの気候の変動性


* 結論
