review/APE/Marshall_et_al_2007.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>Marshall et al (2007) 読書ノート</title>
<!-- 2013-12-16 月 22:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="KAWAI Yuta" />
<link rel="stylesheet" type="text/css" href="./../org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Marshall et al (2007) 読書ノート</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">イントロダクション</a>
<ul>
<li><a href="#sec-1-1">研究の概要</a></li>
<li><a href="#sec-1-2">「水惑星(aquaplanet)」設定を使った先行研究</a>
<ul>
<li><a href="#sec-1-2-1">Hess(1993)</a></li>
<li><a href="#sec-1-2-2">Kirtman and Schneider(2000), Barsugli et al.(2005)</a></li>
<li><a href="#sec-1-2-3">先行研究に対する Marshall et al(2007) の研究の位置づけ</a></li>
</ul>
</li>
<li><a href="#sec-1-3">水惑星設定で得られる気候状態の簡単な特徴(第二節の概略)</a></li>
<li><a href="#sec-1-4">結合システムで見られる変動性について(第三節の概略)</a></li>
</ul>
</li>
<li><a href="#sec-2">結合モデルの記述</a>
<ul>
<li><a href="#sec-2-1">MITgcm(Marshall et al., 1997)</a></li>
<li><a href="#sec-2-2">大気モデル</a></li>
<li><a href="#sec-2-3">海洋モデル</a></li>
<li><a href="#sec-2-4">氷モデル</a></li>
<li><a href="#sec-2-5">強制について</a></li>
<li><a href="#sec-2-6">その他</a></li>
</ul>
</li>
<li><a href="#sec-3">結果</a>
<ul>
<li><a href="#sec-3-1">平均状態</a>
<ul>
<li><a href="#sec-3-1-1">温度, 水蒸気, 風, 海流の分布</a></li>
<li><a href="#sec-3-1-2">子午面循環</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">解析: 力学的な解釈</a>
<ul>
<li><a href="#sec-4-1">定式化</a></li>
<li><a href="#sec-4-2">残差循環の流線関数</a></li>
<li><a href="#sec-4-3">温度躍層の構造の決定</a></li>
</ul>
</li>
<li><a href="#sec-5">解析: 結合システムの熱輸送</a></li>
<li><a href="#sec-6">解析: 結合システムの気候の変動性</a></li>
<li><a href="#sec-7">結論</a></li>
</ul>
</div>
</div>
<div class="abstract">
<ul class="org-ul">
<li>現代の軌道と CO<sub>2</sub> の強制によって駆動される, 陸なしの大気・海洋・氷結合システムの気候の数値実験を行った. 
</li>
<li>約千年間の時間スケールのシミュレーションは, 次の平均状態を与えた. 
<ul class="org-ul">
<li>氷冠は, 緯度 55° まで達した. 
</li>
<li>大気と海洋はともに東西方向の帯状ジェットから成る. ジェットの構造は傾圧不安定によって調整される. 
</li>
<li>海洋の帯状的特徴にもかかわらず, エクマン輸送と渦によって駆動される沈み込みの働きを介した南北方向の熱輸送は
とても効率的である. 
<ul class="org-ul">
<li>大気・海洋間の熱輸送の分配は, 現代気候とかなり同じである(熱帯では海洋, 中高緯度では大気の熱輸送が卓越する). 
</li>
</ul>
</li>
<li>系の変動性は, 大気と海洋の環状モードのカップリングによって支配される. 
<ul class="org-ul">
<li>大気のジェットに由来する確率的な変動性は, 海洋の変動を駆動する. 
</li>
<li>海洋の帯状流は十年周期の変動性を見せる. この変動性は大気にフィードバックして, 
環状モードの変動性のスペクトルを特色づける. 
</li>
<li>簡単な確率モデルによって, この過程を捉えることができる. 
</li>
</ul>
</li>
<li>最後に, 水惑星が, 地球の熱輸送の分配と気候を決める過程の情報をどのように与えることをできるかを, 
再吟味する. 
</li>
</ul>
</li>
</ul>

</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> イントロダクション</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 研究の概要</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>惑星の気候の決定における大気と海洋の相互作用の特性を理解するために, 大気・海洋・氷の結合システムの数値モデルを用いて,
極めて理想化された GFD 的実験を行った. 
<ul class="org-ul">
<li>目標は地球の現在気候や古気候を計算することではなく, 結合システムの詳細を調べることである. 
</li>
<li>地形や海陸分布の複雑性は簡単化して考える(実際陸を完全に取り除く:水惑星設定)が, 
必要とされる流体の力学は十分に表現される. 
</li>
</ul>
</li>
<li>この実験では, 陸がないことを除けば, 全ての他の特徴は現在の地球であるような惑星の極限を調べる. 
<ul class="org-ul">
<li>惑星は 5.2 km の一様な水深をもつ海洋に全体が覆われている. 
</li>
<li>海洋の上には大気が存在し, 入射する太陽放射によってエネルギーを与えられる. 
</li>
<li>条件を満たせば, 氷が形成される. 
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 「水惑星(aquaplanet)」設定を使った先行研究</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>大気モデリングをする研究者の間では, 「水惑星」とは,  
スラブオーシャンまたは指定された海水面温度(SST)分布を結合した大気のことを示唆することに注意すること. 
</li>
</ul>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Hess(1993)</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>指定された SST を使う水惑星設定を用いて, さまざまな緯度依存の SST 分布に対する熱帯収束帯(ITCZ) の感度を調べた. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Kirtman and Schneider(2000), Barsugli et al.(2005)</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>大気を熱力学的な海洋モデルと結合して, 熱帯の降水が熱帯の平均状態に鋭敏であることを示した. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 先行研究に対する Marshall et al(2007) の研究の位置づけ</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>力学を表現し全球中に特性を輸送できる, 大気モデルと海洋モデルをフルカップリングする. 
</li>
<li>このような計算はこれなであまりなされていない. 少数の例は Smith et al.(2006) (S06). 
<ul class="org-ul">
<li>S06 は, 結合システムにおける海洋循環の役割, 
特に全球に熱を輸送するための海洋の能力に対する地理的な制約の重要性を強調する. 
</li>
</ul>
</li>
<li>本論文の純粋な水惑星設定は, S06 の参照実験の設定と同じものであるが, 
海洋モデルの定式化に重要な違いが存在する. 
<ul class="org-ul">
<li>その違いによって, S06 の気候状態と大変異なった気候状態が得られた. 
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 水惑星設定で得られる気候状態の簡単な特徴(第二節の概略)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>大気
<ul class="org-ul">
<li>水惑星の大気は, 現代地球の大気とまずまず似ている. 
<ul class="org-ul">
<li>加熱/冷却の差異によって, 大気の風系は駆動される. 
<ul class="org-ul">
<li>熱帯のハドレーレジーム, 傾圧不安定によって壊れる中緯度のジェット
</li>
</ul>
</li>
<li>(M07 では) 極域の冷却は氷冠の形成をもたらす. 
</li>
<li>大気の総観規模のシステムによる運動量輸送が, 中高緯度域の西風, 低緯度域の東風を維持する. 
<ul class="org-ul">
<li>これらの風は海洋の真上で吹き, 海洋の運動を励起する. 
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li>海洋 
<ul class="org-ul">
<li>海洋において境界がないことは, 現在地球とかなり異なる海洋の循環パターンを与える. 
<ul class="org-ul">
<li>循環パターンは帯状ジェットであり, その方向は大気の優勢な風向きによって決まる. 
<ul class="org-ul">
<li>熱帯ベルトでは東寄り, 中緯度では西寄りのジェット
</li>
<li>この帯状ジェットの力学は現代の南極周回流(Antarctic Circumpolar Current: ACC)の力学を連想させる. 
</li>
</ul>
</li>
<li>海洋の子午面循環は全体的に, 風と渦によって駆動される沈み込みと関係する. 
<ul class="org-ul">
<li>極域で対流的に駆動される「熱塩循環」は存在しない. 
</li>
<li>子午面循環は, 赤道から中緯度まで伸びる, 残差平均により現れる海洋の「亜熱帯」セルを含む. 
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>

<li>大気・海洋間の南北熱輸送の分配 
<ul class="org-ul">
<li>M09 の計算では, 水惑星での大気と海洋の熱輸送の分配は, 現在気候とよく似ていることが分かった. 
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 結合システムで見られる変動性について(第三節の概略)</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>南北方向の境界が存在しないために永続的な東西方向の温度勾配は存在せず, "ENSO"現象は現れない. 
</li>
<li>変動性の卓越するオーダーは中緯度の「環状モード」であり, その環状モードにおいて, 大気の西風は強さと位置の両方がゆらぐ. 
<ul class="org-ul">
<li>この変動は, 海洋の帯状ジェットを駆動する東西風の応力に変化を起こす. 
</li>
</ul>
</li>
<li>結合システムの変動性の究極的な起源は, 大気の帯状ジェットに伴う総観システムの相互作用による「かきまぜ」である. 
</li>
<li>しかし, 二流体の環状モードのカップリングは, 両方の流体で明瞭な十年周期のシグナルをみせることが分かった. 
<ul class="org-ul">
<li>発見した変動性の簡単な確率モデルを開発し, 結合メカニズムの本質をとらえた. 
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 結合モデルの記述</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> MITgcm(Marshall et al., 1997)</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>一つの静力学コアから大気モデルと海洋モデルを得るために, 流体の同型性を採用する. 
</li>
<li>水平格子: 大気・海洋とも立方球面格子
<ul class="org-ul">
<li>解像度 C32(格子幅約 280 km)
</li>
<li>緯度経度格子のように極域で格子が集中しない. 
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 大気モデル</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>中程度の複雑さ(Atmosphere InterMediate complexity: AIM)
<ul class="org-ul">
<li>鉛直解像度: 5 層(75, 250, 500, 750, 950 hPa)
</li>
<li>物理過程: SPEEDY(Molteni, 2003)
<ul class="org-ul">
<li>4 バンド放射スキーム, 湿潤対流パラメタリゼーション, 境界層スキーム他
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 海洋モデル</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>鉛直解像度: 15 層
<ul class="org-ul">
<li>海底は平坦で, 海洋の深さは 5.2 km
</li>
<li>層の幅は表層で 50 m, そして深くなるほど大きくなり, 深部では 690 m. 
</li>
</ul>
</li>
<li>diapycnal 混合
<ul class="org-ul">
<li>混合係数: 3&times;10<sup>-5</sup> m<sup>2</sup> s<sup>-1</sup> 
</li>
</ul>
</li>
<li>海底の摩擦
<ul class="org-ul">
<li>海底が平坦なため, 風により注入された運動量とバランスする役割を果たす, 地形の摩擦が存在しない. 
<ul class="org-ul">
<li>一方, ACC では海底地形の摩擦が主な運動量のシンク. 
</li>
</ul>
</li>
<li>強い順圧的な帯状流の生成を避けるために, 深層流がゼロとなるように海底の(線形)摩擦パラメータを調整する. 
</li>
</ul>
</li>
<li>(地衡流)渦のパラメタリゼーション
<ul class="org-ul">
<li>Gent and Williams(1990)
</li>
<li>輸送係数: 800 m<sup>2</sup> s<sup>-1</sup>
</li>
</ul>
</li>
<li>対流のパラメタリゼーション
<ul class="org-ul">
<li>対流調節: 温度・塩分の強い鉛直混合として実装
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 氷モデル</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>熱力学的氷モデル(Winton, 2000)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 強制について</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>軌道と関係した強制, CO2 レベルは, 現在気候の値を使う. 
<ul class="org-ul">
<li>季節サイクルは表現されるが, 日変化は存在しない. 
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> その他</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>システム全体は, 並列計算機上で時間積分される. 
<ul class="org-ul">
<li>大気モデルは各面ごとに 1 CPU, 海洋モデルとカップリング処理にそれぞれ 1 CPU づつ割り振る. 
</li>
<li>結合モデルを 1000 年間積分するのに二週間かかる. 
</li>
</ul>
</li>
<li>大気・海洋モデル間の, 運動量, 熱, 淡水フラックスの交換は, 毎時間(海洋モデルの時間ステップ)で行う. 
</li>
<li>海洋モデルの初期条件: 静止状態. 温度と塩分は気候値の東西平均. 
</li>
<li>4000 年積分するとおおよそ準平衡状態に落ち着く. 
<ul class="org-ul">
<li>以後示す平均状態とは, 最後の 100 年間の場を平均したものである. 
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 結果</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 平均状態</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> 温度, 水蒸気, 風, 海流の分布</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>温度
<ul class="org-ul">
<li>熱帯域で弱い水平温度勾配, そしてその終端から極まで広い傾圧帯が両半球で見られる.
</li>
<li>極は寒冷(約250K)で 55 度付近まで氷に覆われている. 
</li>
<li>海氷の下では, 数百メートルの温度の逆転層が見られる. 
<ul class="org-ul">
<li>塩分はそれを補償するように小さい. 
</li>
</ul>
</li>
<li>水惑星の主躍層は地球と似ている. 
<ul class="org-ul">
<li>暖水域の深さは亜熱帯で約 1 km, 赤道の湧昇域では著しく薄い. 
</li>
</ul>
</li>
<li>温度躍層や極域の下では, 深層の約 2 ℃ の温度で良く混ぜられている. 
<ul class="org-ul">
<li>良く混合した深層の流体は, 高緯度域の上昇流によって海面まで持ち上げられる. 
</li>
</ul>
</li>
</ul>
</li>

<li>風
<ul class="org-ul">
<li>境界層や熱帯から遠い場所では, 風や海流は南北温度勾配と関連した温度風バランスにある. 
</li>
<li>亜熱帯の西風ジェット(250 hPa で 30 ms<sup>-1</sup> に達する), 赤道域では東風. 
<ul class="org-ul">
<li>緯度 30 度より極側では海面の西風が東向きの応力を, 赤道の両側では貿易風が西向きの応力を引き起こす. 
</li>
<li>極偏東風は存在しない. 
</li>
</ul>
</li>
</ul>
</li>

<li>海流
<ul class="org-ul">
<li>海岸が存在しないため, 海洋では, 海面応力と同方向の帯状ジェットが見られる. 
<ul class="org-ul">
<li>内部領域では, 帯状ジェットは傾いた密度面と関係した温度風バランスにある. 
</li>
</ul>
</li>
<li>海面応力は eddy drag により弱められながら流体コラムの下まで達し, 海底の応力と完全にバランスする. 
</li>
<li>海面において, 赤道に沿う西向きの流れは 0.8 ms<sup>-1</sup>, 中緯度の東向きの流れは 0.2 ms<sup>-1</sup> に達する. 
</li>
</ul>
</li>

<li>海洋の鉛直流
<ul class="org-ul">
<li>海面応力の回転により駆動されるエクマン・パンピングの場は, 温度躍層の下部表面のうねりを説明する. 
</li>
<li>赤道帯(応力の回転がゼロとなる緯度 20 度まで)では, 深部の冷水が上昇している.  
</li>
<li>緯度 20 度から 45 度の間では, 暖水が地表から下降している. 
</li>
</ul>
</li>

<li>水蒸気, 塩分
<ul class="org-ul">
<li>比湿は空気の暖かいところで大きい(赤道下層で, 15 g kg<sup>-1</sup>, 高度や緯度が高くなるにつれ減少). 
</li>
<li>水蒸気の「mirror imgae」である海洋の塩分場は, 舌状の分布をみせる. 
<ul class="org-ul">
<li>亜熱帯では蒸発が降水を上回る. 熱帯・高緯度では, 降水が蒸発を上回る. 
</li>
</ul>
</li>
<li>氷の下の塩分の低さは, 温度の逆転を安定化させている. 
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> 子午面循環</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>オイラー平均子午面循環 
<ul class="org-ul">
<li>大気: 赤道の両側で対称なハドレーセル, 中・高緯度でフェレルセル. 
</li>
<li>海洋: 大気の子午面循環と同じパターン 
</li>
<li>大気・海洋の境界層内で大規模渦による水平渦運動量フラックスが無視できる限り, 両方の流線関数は同じになるだろう. 
<ul class="org-ul">
<li>熱帯域のハドレーセルでは当てはまる. 
</li>
<li>中緯度では大気の流線関数が 50 % ほど海洋を上回る(しかしオーダ的には同じ). 
<ul class="org-ul">
<li>総観規模の渦と関係した渦運動量フラックスが無視できないため
</li>
</ul>
</li>
</ul>
</li>
<li>しかし, 大気の渦が駆動する質量フラックスは, 海洋の典型的な子午面循環の強度よりずっと強い
<ul class="org-ul">
<li>大気・海洋間の熱輸送の分配に関する重要な事実
</li>
</ul>
</li>
</ul>
</li>

<li>海洋の残差循環
<ul class="org-ul">
<li>(残差循環) = (オイラー平均) + (渦で駆動される循環)
<ul class="org-ul">
<li>渦で駆動される循環は,  オイラー平均と逆センスの傾向がある. 
</li>
<li>中・高緯度では, 完全にキャンセルする. 
</li>
</ul>
</li>
<li>なぜ逆センスなのか? (Gill et al, 1974)
<ul class="org-ul">
<li>海面応力のパターンは, 亜熱帯で海面の浮力分布を押し下げ, 熱帯と高緯度で深層の浮力を吸い上げる. 
</li>
<li>等密度面の傾きは, 傾圧不安定のための有効位置エネルギーを貯蓄する. 
</li>
<li>傾圧不安定は平均的な浮力面を平坦にする &lt;- これは海面の風の効果と相反する. 
</li>
</ul>
</li>
<li>極域の海洋の成層は弱いが, 極の沈み込みによって駆動される熱塩循環は見られない.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 解析: 力学的な解釈</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Marshall and Radiko(2003) (MR03) : ACC のような海洋の帯状流に対する簡単なモデルを開発. 
<ul class="org-ul">
<li>MR03 のモデルを適切に修正することによって, 水惑星の海洋の平均的な状態(平均子午面循環)を説明する. 
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 定式化</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>帯状平均, 残差平均された運動量方程式

\begin{equation}
 - f v_{res} = \frac{1}{\rho} \left[ 
   \left( \frac{\partial \tau}{\partial z} + \frac{\partial \tau_e}{\partial z} \right)
   + A_h \nabla^2 u_{res}
   \right]
\end{equation}

<ul class="org-ul">
<li>where \(\tau\) は(海面/海底の)応力. 渦応力は, 

\begin{equation}
  \tau_e = \rho f \frac{\overline{v'b'}}{\partial \bar{b}/\partial z}
    = \rho f K s_\rho = \rho f \psi^*
\end{equation}

<p>
とパラメータ化する. 
\(\Psi^*\) は bolus streamfuncion, \(K(=-\overline{v'b'}/(\partial \bar{b}/\partial y))\) は渦輸送係数, 
\(s_\rho(= - (\partial \bar{b}/\partial y)/(\partial \bar{b}/\partial z))\) は平均的な浮力面の傾き. 
</p>
</li>

<li>これは, Gent and McWilliams(1990) のパラメタリゼーションの残差平均の解釈である. 
</li>
<li>運動量の水平混合を表す項を含めている. 
<ul class="org-ul">
<li>西岸境界流と関係した摩擦境界層(Munk, 1950)を表すモデルで必要とされる
</li>
</ul>
</li>
</ul>
</li>

<li>帯状平均, 残差平均された浮力方程式

\begin{equation}
  J(\Psi_{res}, \bar{b}) = \frac{\partial \mathscr{B}}{\partial z}
\end{equation}

<ul class="org-ul">
<li>where \(\mathscr{B}\) は, 小スケールの過程や大気-海洋のフラックスによる浮力フラックス. 
</li>
<li>内部領域では浮力フラックスの寄与は小さく, 近似的に \(J(\Psi_{res}, \bar{b})=0\) である. 
<ul class="org-ul">
<li>実際, Fig.4(bottm) のように, \(\Psi_{res}\) と \(\bar{b}\) の等値線は重なる. 
</li>
</ul>
</li>
<li>温度躍層の構造を求めるには, \(\Psi_{res}\) と \(\bar{b}\) の関数関係が表層の過程により決められる必要がある. 
<ul class="org-ul">
<li>Marshall(1997) では \(\Psi_{res} = - \mathscr{B}_s/\bar{b}_y\) と決まったが,
今の場合, そのような簡単な関係は見つけられないので, モデル結果から与える.
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 残差循環の流線関数</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>帯状平均, 残差平均された運動量方程式を海面から \(z\) まで積分すれば, 

\begin{equation}
  \Psi_{res} (y,z) = - \frac{1}{\rho} \frac{\tilde{\tau}}{f} + K s_\rho = \overline{\Psi} + \Psi^*
  \label{BolusStreamFunc}
\end{equation}

<ul class="org-ul">
<li>where
</li>
</ul>
<p>
\[
      \tilde{\tau} = \tau_s + \int^0_{-z} A_H \nabla^2 u \; dz
  \]
</p>

<ul class="org-ul">
<li>水平方向の運動量混合が無視できるならば, \(\bar{\Psi}\) は深さに依存しない. 
<ul class="org-ul">
<li>このとき, 海面と海底のエクマン層の輸送は真反対になる.  
</li>
</ul>
</li>
<li>しかし, 実際 \(\bar{\Psi}\) は内部領域で深さに依存している. 
<ul class="org-ul">
<li>運動量バランスの中で粘性の役割は, 無視できない. 
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 温度躍層の構造の決定</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>アルゴリズム

<p>
\(\eqref{BolusStreamFunc}\) を整理して, 
</p>

\begin{equation}
  s_\rho = \dfrac{1}{K} \left[ \Psi_{res}(\bar{b}) + \dfrac{1}{\rho}\dfrac{\tilde{\tau}}{f}   \right]
  \label{relattion_bSlope_resSF_eulerM}
\end{equation}

<ul class="org-ul">
<li>表層の \(\bar{b}\) 分布とモデルから得られる関数間係 \(\Psi(\bar{b})\) を与えれば, 特性法(see MR03)を使って上の式を積分することにより, 
    \(\bar{b}\) の解を得る(Fig. 5).  
</li>
</ul>
</li>

<li>得られた解とモデルの計算結果の比較(Fig.5)
<ul class="org-ul">
<li>両者は良く一致している. 
</li>
<li>MR03 の ACC とその子午面循環の理論の心である力学バランス \(\eqref{relattion_bSlope_resSF_eulerM}\) が, 水惑星の海洋に適切であることを示唆する. 
<ul class="org-ul">
<li>スベルドラップバランスとは, 根本的に違う点に注意
</li>
</ul>
</li>
<li>温度躍層の深さは渦のプロセスによって根本的に制限される. 
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 解析: 結合システムの熱輸送</h2>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 解析: 結合システムの気候の変動性</h2>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 結論</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: KAWAI Yuta</p>
<p class="date">Created: 2013-12-16 月 22:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
